
import useFetch from "./useFetch";
import { useParams } from "react-router-dom/cjs/react-router-dom.min";

const BookContent = () => {
    const {id}= useParams();
    console.log(id);
    const {data:books, isPending} = useFetch('http://localhost:8080/api/v1/book/'+id);
    console.log(books);
    console.log(isPending);
return(
  
    <div className="book-content-main px-3 py-1">
      <div className="book-nav">
        <div className="bookContent-title">
          <p className="flex-1 text-light">{books?.book.title}</p>
          <i className="fa-regular fa-heart flex-1"></i>
          {/* <i class="fa-solid fa-heart"></i> */}
          <i className="fa-solid fa-ellipsis-vertical flex-1"></i>
        </div>
        <div className="bookContent-title-right">
          <div className="search-page">
            <div className="input-group">
              <input type="number" className="form-control" />
              <button
                className="btn bg-light text-dark"
                type="button"
                id="SearchBar"
              >
                <i className="fa-solid fa-magnifying-glass"></i>
              </button>
            </div>
          </div>
          <button className="btn btn-outline-light py-0">
            <i className="fa-solid fa-backward"></i>
          </button>
          <button className="btn btn-outline-light py-0">
            <i className="fa-solid fa-forward"></i>
          </button>
          <button className="btn btn-outline-light py-0">
            <i className="fa-regular fa-bookmark"></i>
          </button>
          <button className="btn btn-outline-light py-0">
            <i className="fa-solid fa-bookmark"></i>
          </button>
          <button className="btn btn-outline-light py-0">
            <i className="fa-solid fa-caret-left"></i>
          </button>
          <button className="btn btn-outline-light py-0">
            <i className="fa-solid fa-caret-right"></i>
          </button>
          <button className="btn btn-outline-light py-0">
            <i className="fa-solid fa-maximize"></i>
          </button>
        </div>
      </div>
      <div className="row book-row px-2">
        <div className="col-6 paper-1 py-2 px-3">
          <h5 className="text-center">၁</h5>
          <p>
            ကုန်းဘောင်မင်းဆက်၏ နောက်ဆုံးမင်းဖြစ်သော သီပေါမင်းသည်
            မင်းတုန်းမင်းကြီး နတ်ရွာစံပြီးနောက် နန်းတက်တော်မူသည်။
            “မာရ်အောင်ရတနာစေတီတော် တည်ထားကိုးကွယ်သောကြောင့် မာရ်အောင်ရတနာ
            ဒါယကာဘဝရှင်မင်းတရား” ဟူ၍၎င်း၊ ငယ်စဉ်က သီပေါမြို့ကို စားရသောကြောင့်
            “သီပေါမင်း” ဟူ၍၎င်း၊ မန္တလေးရတနာပုံမြို့တွင် ဒုတိယနန်းစံသော
            မင်းဖြစ်သဖြင့် မန္တလေးရတနာပုံ “ဒုတိယမြို့နန်းစံမင်း” ဟု၎င်း၊
            အိန္ဒိယနိုင်ငံ မဒရပ် မြို့သို့ဗြိတိသျှတို့၏ ဆောင်ယူသွားခြင်း
            ခံရသဖြင့် “မဒရပ်ပါမင်း” ဟူ၍၎င်း ထင်ရှားသည်။ ငည်မည်မှာ #မောင်မျိုးဆက်
            တည်း။ သီပေါမင်းကို ပဉ္စမသင်္ဂါယနာတင် #မင်းတုန်းမင်းတရားကြီး
            နှင့်ဘထွေးတော် သီပေါစော်ဘွား၊ ချွန်းတောင်မြို့စား၊
            မိုးနဲဗိုလ်မှူးမင်းသား သမီးတော် “သီရိမဟာမင်္ဂလာ သုပဘာဒေဝီ” ဘွဲ့ခံ
            #လောင်းရှည်မိဖုရား" ( နန္ဒာဒေဝီ) တို့မှ သက္ကရာဇ် ၁၂၂ဝ-ပြည့်နှစ်၊
            နတ်တော်လပြည့်ကျော် ၁၂-ရက်၊ စနေနေ့တွင် ဖွားမြင်တော်မူသည်။
            မယ်တော်လောင်းရှည်မိဖုရားအား မင်းတုန်းမင်းတရားကြီးက
            စိတ်အခန့်မသင့်ဖြစ်၍ အိမ်နိမ့်ချထားစဉ် သီပေါမင်းသားသည်
            #တပယ်မင်းသား၏အိမ်တော်၌ ငြိုငြင်စွာနေရသည်။ ထို့နောက်
            အခြားသားတော်များနှင့်အတူ #ဆရာမှတ်ကြီး၏ သံတဲကျောင်း၌
            အင်္ဂလိပ်စာပေပညာသင်ကြားရလေသည်။ ၁၂၃၆-ခုနှစ်တွင် ခမည်းတော်မင်း
            တရားကြီးက ရှင်သာမဏေအဖြစ်ဖြင့် သာသနာ့ဘောင်သို့
            သွတ်သွင်းခြီးမြှင့်တော်မူပြီးလျှင် “မာလာလင်္ကာရသီရိဓဇ
            မဟာဓမ္မရာဇဂုရု” တံဆိပ်တော်ရ တောင်တော်ဆရာတော်ထံ
            အပ်နှံတော်မူခြင်းခံရသည်။ ထိုနှစ်တွင်ခမည်းတော်မင်းတရားကြီးက သားတော်
            သမီးတော်များ ပဌမပြန်စာမေးပွဲဝင်ရမည် အမိန့်တော်မြတ် မှတ်တော်မူရာ
            ၁၂၃၇-ခုနှစ်ခန့်တွင် သီပေါမင်းသား လူဝတ်လဲ၍ ပဌမငယ် ပြန်ဆိုသည်။
            ထိုနောက် ရှင်သာမဏေ ပြန်ဝတ်လေသည်။ ၁၂၃၈-ခုနှစ်တွင် ပဌမလတ် စာပြန်ပွဲကို
            လူဝတ်လဲ၍ပြန်ဆိုပြီးနောက် ရှင်သာမဏေပြန် ဝတ်ပြန်သည်။ ၁၂၃၉-ခုနှစ်တွင်
            ပဌမကြီးစာပြန်ပွဲကို အထက်နည်းအတိုင်း အောင်မြင်စွာပြန်ဆိုနိုင်ပြန်သည်။
            သားတော်များထဲတွင် တစ်ဦးတည်းထူးချွန်စွာ ပဌမပြန်ဆိုနိုင်သော
            သားတော်သီပေါ မင်းသားအား ခမည်းတော် မင်းတရားကြီးသည် အားရတော်မူလှသဖြင့်
            ညီလာခံလွှတ်တော်သို့ အခမ်းအနား ရထားဆင်ယင် တပ်ဝင်းခင်း
            ကျင်းကာဝင်စေသည်။
          </p>
        </div>
        <div className="col-6 paper-2 py-2 px-3">
          <h5 className="text-center">၂</h5>
          <p>
            ထိုနောက် လူဝတ်လဲစေ၍ နန်းတော်အတွင်း
            တံခါးနီအပြင်လွှတ်တော်မြောက်ဘက်တွင် မင်္ဂလာအိမ်တော်ဆောက်ပေးစံနေစေသည်။
            မင်းတုန်းမင်းတရားကြီးသည် သာသနာတော်ကို အထူးလေးစားတော်မူသည့် အလျောက်
            ပဌမပြန်စာမေးပွဲကို ပြန်ဆိုအောင်မြင်ခဲ့သော သားတော် သီပေါမင်းသားအား
            များစွာချစ်ခင်နှစ်သက်တော်မူသဖြင့် အပါးတော်၌ မပြတ်ထွက်ဝင်ခစားစေသည်။
            ပဌမပြန် အောင်ဆုသည်ပင် သီပေါမင်းသားအား မင်းအဖြစ် ရောက်သည်တိုင်အောင်
            ကျေးဇူးပြုသည်ဟု ဆိုရမည် ဖြစ်ပေသည်။ ၁၂၄ဝ-ပြည့်နှစ်၊ ဝါခေါင်လတွင်
            မင်းတုန်းမင်းတရားကြီး မကျန်းမမာရှိတော်မူသောအခါ နန်းတော်တွင်း၌
            တန်ခိုးကြီးနေသော မင်းတုန်းမင်းကြီး၏ အလယ်နန်းမိဖုရား #ဆင်ဖြူမရှင်
            နှင့် #ကင်းဝန်မင်းကြီး စသော အလိုတူသည့် မှူးတော်မတ်တော်တို့
            တိုင်ပင်ကြပြီးလျှင်သားတော် သီပေါမင်းသားအား အိမ်ရှေ့ဥပရာဇာ
            ဆောင်နှင်းရန် မင်းတရားကြီးအားတင်လျှောက်၍ ထိုနှစ်
            တော်သလင်းလပြည့်ကျော် ( ၉ ) ရက်နေ့တွင် အိမ်ရှေ့အပ်နှင်းလေသည်။
            သားတော်ကြီးများဖြစ်သော #သုံးဆယ်မင်းသား၊ #ညောင်ရမ်းမင်းသား၊
            #မက္ခရာမင်းသား တို့ရှိပါလျက် သားတော်အငယ် သီပေါမင်းသားအား
            ကင်းဝန်မင်းကြီး စသော မှူးမတ်များက လိုလားရခြင်းမှာ စိတ်ထက်မြက်သော
            မင်းသားများဘုရင်ဖြစ်လျှင် နိုင်ငံအုပ်ချုပ်မှုနှင့်
            နိုင်ငံခြားဆက်သွယ်မှုများကို မိမိတို့သဘောကျ ဆောင်ရွက်နိုင်မည်မဟုတ်၊
            အသက်ငယ်၍ သဘောနူးညံ့သော မင်းသားနှင့်မှ သဘောကျဆောင်ရွက်နိုင်မည်ဟု
            ယုံကြည်သောကြောင့် ဖြစ်လေသည်။ ကင်းဝန်မင်းကြီးသည်
            ဒီမိုကရေစီထွန်းကားသော အနောက်နိုင်ငံများသို့ရောက်ခဲ့ရှိကာ
            မိမိနိုင်ငံတိုးတက်ရေး အတွက် ထိုနိုင်ငံများကဲ့သို့ ဘုရင်၏အာဏာကို
            ကန့်သတ်ကာဝန်ကြီးအဖွဲ့နှင့် တိုင်းပြည်ရေးရာများကို
            စီမံခန့်ခွဲသွားနိုင်သည့် အုပ်ချုပ်ရေး စနစ်သစ်ကို တီထွင်လိုသဖြင့်
            မိမိဩဇာညောင်းမည်ထင်သည့် သီပေါမင်းသားကို သဘောတူခြင်းဖြစ်လေသည်။
            ဆင်ဖြူမရှင်မိဖုရားကြီး၌မူ မိမိ၌သားတော်မရှိသဖြင့်
            မိမိသမီးတော်နှင့်ရည်ငံရင်းစွဲရှိသော သီပေါမင်းသားအား
            သဘောတူညီခြင်းဖြစ်လေသည်။ သီပေါမင်းသား အိမ်ရှေ့အရာကိုရပြီးနောက်
            မင်းတုန်းမင်း၏အခြား သားတော်ကြီး များကိုဖမ်းဆီးချုပ်နှောင်ထားလေသည်။
            ၁၂၄ဝ-ပြည့်နှစ်၊ သီတင်းကျွတ်လဆန်း ၆-ရက်နေ့တွင် မင်းတုန်းမင်းကြီး
            နတ်ရွာစံသောအခါ ထိုနေ့တွင်ပင် အိမ်ရှေ့စံ သီပေါမင်းသားသည်
            ထီးနန်းကိုသိမ်းပိုက်တော်မူသည်။ ၁၂၄၁-ခုနှစ်၊ နယုန်လတွင်
            သီပေါမင်းတရားကြီးသည် သီရိပဝေသနာဘိသိက်ကိုသွန်းခံတော်မူ၍ ထီးဆောင်း
            မင်္ဂလာဥကင်သဖွင့်တော်မူပြီးလျှင် “သီရိပဝရာဒိတျတိလောက ဓိပတိ ပဏ္ဍိတ
            မဟာဓမ္မရာဇာဓိရာဇာ” ဘွဲ့တံဆိပ်နာမတော်ကို ခံတော်မူသည်။{" "}
          </p>
        </div>
      </div>
      <button className="btn btn-wood py-0 px-2 p-arrow-left">
        <i className="fa-solid fa-caret-left"></i>
      </button>
      <button className="btn btn-wood py-0 px-2 p-arrow-right">
        <i className="fa-solid fa-caret-right"></i>
      </button>
    </div>
)};

export default BookContent;
